[
  {
    "title": "NACA0012 Airfoil, Rival Lab",
    "image": "naca0012",
    "blurb": ["This NACA0012 airfoil was my first project with the Rival Lab, which focuses on bio-inspired experimental fluid dynamics. It is a complex CAD model containing an embedded network of pressure-measurement channels, taps, and transducer ports that are geometrically optimized to reduce noise and signal error. The model is now being 3D-printed by our partners at EPFL in Switzerland to be used for water-tunnel experiments.","The pressure taps are spaced evenly across the airfoil's 150mm chord length (x-axis), and positioned roughly halfway across its 580mm span (z-axis), in an alternating pattern of ±2.5mm along the z-axis relative to the midway plane. This latter arrangement will hopefully help prevent turbulence and vortices developed at pressure taps from affecting measurements made at other taps in their leeward direction.","The tap geometry is designed according to findings from the Springer Handbook of Experimental Fluid Mechanics. For narrow tappings with d_c = 2*d_s, the lowest pressure error occurs at a relative tapping depth of l_s/d_s = 0.5. Setting the cavity diameter (d_c) as 4mm to match that of the tube connector, the optimal orifice diameter (d_s) and depth (l_s) were found to be 2mm and 1mm, respectively.", "As the minor losses caused by bends are more significant than friction losses, the channels were designed to be as straight as possible at the expense of maintaining uniform channel length. It is impossible to satisfy both characteristics due to the NACA0012’s asymmetry.","The 13x13mm square hole is designed to fit the metal rod needed to mount the airfoil in a water tunnel. Originally, the plan was for the rod hole pass through the entire airfoil span. However, this arrangement overlapped with two of the pressure taps and channels. Instead, the rod hold was divided into two segments (260mm each) relative to the front and rear faces, respectively. This left a solid region of length 60mm centred about the midway plane, which allowed for these two pressure channels to be designed without adjusting their tap position. A trade-off, however, is that these channels bend somewhat abruptly compared to the others.", "Each transducer port is designed to fit a 4mm tube connector mounted within a 7mm hex nut. The slots that fit the nuts are slightly oversized to account for an assumed hex nut tolerance of ±0.31 mm."]
  },

  {
    "title": "Thermal Management System Capstone Project",
    "image": "capstone",
    "blurb": ["I am involved in a year-long industry partnership with a manufacturer of heavy-duty electric vehicles. Our team is designing an optimized thermal management system that minimizes redundancy while maintaining the sensitive operating temperatures of Li-ion batteries, motors, and auxiliary components. We validate this design using multi-objective optimization techniques, which are computed using simulations and numerical models that we have developed.","While the system cannot be depicted in full due to confidentiality reasons, the above diagram depicts an idealized thermodynamic model of the TMS being designed by our group. Thermodynamic states are indicated by numbered circles, with State 1 depicting the coolant reservoir, State 9 indicating the chiller discharge, and State 11 being the battery pack outflow. The coolant reservoir was assumed to be large enough in volume such that only negligible temperature fluctuations occur. State 1 was thus a convenient choice to serve as the system’s state of reference (datum), with a temperature equal to ambient and a pressure of 1 atm. ", "While different operating modes are possible (e.g. preconditioning), the only scenario considered here is “motor-activation mode”, where the motor, air compressor, and heater are on, and the heater and charging components are off. All pipes in the above diagram are assumed to be equal in diameter and have well-insulated walls that prevent stray heat transfer effects. The flow of WEG itself is steady, inviscid, and incompressible. Each of the three-way valves that have two open exits distribute exactly 50% of the inflow to each, which allows for the mass flow rate fractions to be easily determined through visual inspection. Since the system is modelled at steady state, all valves are treated as static elements, and the nuances between the variable-controlled and step-controlled valves are ignored. Lastly, all heat-exchanging components except for the batteries are assumed to add or remove heat from the system at fixed rates. Their values were selected from pre-existing component datasheets. Oftentimes, however, this exact information was unavailable, which required some extra assumptions and educated guesses to be made. These parameters will become more refined as the associated Simulink model improves, as much more precise results can be computed given a set of initial conditions.","The first law of thermodynamics can be used to perform control-volume analysis between any two or three adjacent states in the above diagram. For example, the chiller was modelled as a heat exchanger and uniform black box. For example, applying the above assumptions reduced the first law to the following for process 8-9 across the chiller:","Qdot_out = (mdot/2)*(h8-h9) = (mdot/2)*Cp*(T8-T9)","The same reductive approach was applied throughout every adjacent thermodynamic state in the diagram. The ultimate goal in doing so was to derive a closed-form analytical expression that relates the battery temperature between States 10 and 11 directly to the ambient conditions at State 1. This expression could then be incorporated into the Simulink model’s electromechanical control system as a transfer function. These efforts are ongoing and evolving."]
  },
  {
    "title": "QVFT Aeroponic System Overview",
    "image": "top-view",
    "blurb": ["QVFT employs an aeroponic cultivation method, in which plants grow without soil and are fed by a nutrient-enriched mist. Crops rest in thin, plastic root cups, through which their roots hang into a basin below. Aeroponic vertical farming lends well to automation and can allow for near-complete control over the plant growth environment. The system is broadly divided into five zones: mixing tank, nutrient zone, supply line, growth zone, and return line.", "The mixing tank is the central hub of the farm. Recycled water from the return line is replenished with nutrients from the nutrient zone before being dispensed to the supply line as needed."]
  },
  {
    "title": "QVFT Nutrient Zone",
    "image": "nutrient-zone",
    "blurb": ["The nutrient zone replenishes macronutrients and micronutrients consumed by the plants during growth and helps to maintain a consistent, weakly acidic pH. Nutrients A and B are kept in separate tanks to prevent their dissolved solutes from reacting with each other while in storage. The pH tank contains a mixture to counterbalance the water acidification caused by the reverse-osmosis process performed in the return line."]
  },
  {
    "title": "QVFT Supply Line",
    "image": "supply-line",
    "blurb": ["The supply line transports nutrient-enriched fluid from the mixing tank to four sprinkler lines laid across the two levels of the growth zone. The 3-way valve normally permits outflow to the growth zone and prevents outflow to the excess water storage tank. However, its orientation can be reversed by the automation subsystem when the mixing tank contains excessive water or must be drained for maintenance. The valve always permits inflow from the mixing tank.", "The supply pump works in concert with a pressure switch, accumulator, and pressure regulator to maintain a consistent 60-120 psi pressure at the sprinklers. The sprinklers require this pressure range to produce the microscopic mist droplet size that allows for rapid nutrient absorption by the plant roots.", "Two solenoid valves control the misting cycles for the two levels of plants in the growth zone. Currently, the cycle is planned to be: 15 seconds ON (valves=open) and 30 seconds OFF (valves=closed). The diaphragm accumulator prevents pressure fluctuations between these two modes by storing excess supply line pressure when the solenoids are closed and passively releasing it when they are opened.", "A manual pressure release valve is included to allow an operator to depressurize the supply line before performing maintenance tasks.", "Conservation laws were used to determine the pump size and pipe dimensions that would provide the required sprinkler pressure of 60-120 psi. A MATLAB script was created to perform these calculations."]
  },
  {
    "title": "QVFT Growth Zone",
    "image": "growth-zone",
    "blurb": ["The growth zone contains two levels that together hold 48 plants. The plants rest in thin, plastic cups which have slots through which their roots can dangle into a plastic growth basin. Mist is emitted from 96 sprinkler heads (48/level), which are oriented at alternating angles to ensure complete mist coverage of the growth basin. After spraying, the mist collects on the sloped floor of the growth basin and passively trickles through the drain and towards the return line. Compared to the inflow from the supply line, the outbound fluid will be slightly nutrient-depleted and will have lost some volume due to evaporation."]
  },
  {
    "title": "QVFT Return Line",
    "image": "return-line",
    "blurb": ["The vast majority of the mist sprayed in the growth zone can be recollected and recycled by the return line. Outflow from the growth zone is first stored in the farm runoff storage tank. From here, it will be pumped through a series of filters in the return line be-fore finally being expelled to the mixing tank for reuse.", "The 3-way valve normally permits inflow from the farm runoff storage tank and prevents inflow from the freshwater storage. However, its orientation can be reversed by the automation subsystem when extra water is needed in the mixing tank, and there is insufficient fluid available in the farm runoff storage tank. The valve always permits outflow towards the rest of the return line.", "Two identical filtration branches are arranged in parallel, each of which can be blocked or unblocked with a manual shutoff valve. In practice, only one filtration branch will be active at a time. The inactive branch serves as a bypass for when the filter components on the main branch are being maintained or replaced. In these situations, the main branch’s manual shutoff valve would be closed, and the bypass branch’s valve opened, thereby allowing the farm to continue operating without interference. Check valves are strategically placed on either side of the airlock to prevent flow from the main branch from passing backwards down the bypass branch or vice versa.", "There is a particle filter, RO filter, and ultraviolet (UV) filter on each filtration branch. The particle filter removes larger sediments from the fluid, while the RO filter eliminates most of the remaining nutrients and the UV filter kills any pathogens.", "The mixing tank contains an electrical conductivity (EC) meter, which is a useful tool that can detect the total concentration of solids (i.e., nutrients) dissolved in a fluid. However, it is entirely unable to determine the partial concentrations of individual species which comprise that solute. Given this limitation, all remnant nutrients within the recycled fluid will be stripped in the return line via RO (EC reduced to ~0) before being released to the mixing tank. Doing so will allow for an ideal dose to be consistently added to the mixing tank by the nutrient zone."]
  },
  {
    "title": "COVID-19 Ventilator, Code Life Ventilator Challenge",
    "image": "ventilator",
    "blurb": ["Last spring, I collaborated with a team of professional engineers to develop the “AirMax DMV”, a low-cost, oxygen-generating mechanical ventilator intended to address shortages caused by COVID-19 in developing countries. Our design ranked in the top 65 of 1,029 international submissions at the Code Life Ventilator Challenge in March 2020. One of my contributions involved computational fluid dynamics, where I applied the Brinkman equations for flow through porous media. The goal of this process was to quantify the degree of oxygen generation within zeolite adsorption cylinders.","This device is a fully capable, low-cost mechanical ventilator able to facilitate invasive, non-invasive (NIV), and continuous positive airway pressure (CPAP) ventilatory regulation. Using a built-in control pad, this compressor-based device allows a clinician control over all necessary parameters, including airflow pressure, minute volume, and oxygen concentration. Auxiliary equipment pertaining to inspiratory and expiratory function such as airway hoses can be connected to the unit through two universal connection ports.","In contrast to most existing ventilators, this device is able to supplement compressed-air oxygen with oxygen extracted directly from its surroundings. Based on the pressure vacuum swing adsorption (PVSA) technique, this device uses a pair of Zeolite 13X cells to convert ambient air into a gas mixture of 88-92% oxygen by extracting and removing nitrogen. In a pinch, where no external oxygen cylinder is available, adequate care can be provided purely through ambient air enrichment.","Air processed by the oxygen generator is then fed through a compressor and pressurized. The enriched air is then purified at Filter 3, fed through Valve 4 (V4) and Non-Return Valve 4 (N4), and then stored in the mixer tank. Oxygen can also be derived from a pressurized external compressed-air cylinder. This pure oxygen can be fed directly into the mixer tank, by way of V1 and N1. V7 serves as a pressure- reduction valve, ensuring that the external oxygen source enters the mixer tank at constant pressure. Oxygen concentration in the mixer can be decreased by dilution with unenriched ambient air, which enters through Filter 1, is pressurized by the air compressor, and is then fed through V2 and N2.","All oxygen and pressure data is monitored in real-time by a pair of sensors, which relay this information to the user interface. Pressure will be maintained at around 400-450 kPa, with a safety valve (via N3, V3) providing relief if this threshold is superseded. Oxygen concentration in the mixer tank will be controlled by the operator, adjustable in 5% increments to a maximum of 100% pure oxygen.","When needed for use, the mixer tank air flows through N5, V5, and Filter 2. Operated by a micro-controller, V5 opens to varying degrees to produce the I:E ratio required for a given patient. The pressure-regulation (V6) and flow-regulation (V8) valves then work in concert to produce the required tidal volume, which may range from 200-600 mL. This tidal volume is verified by the inflow sensor, to determine that V6 and V8 are working properly. Subsequently, the air passes through an assisted-control (AC) system, which allows for various modes. After AC, there is a pressure sensor. Then, positive-end expiratory pressure (PEEP6) is provided by holding back some about of the mixture during the CPAP7 mode and providing positive pressure at the end of expiration when needed. This is linked to a pressure sensor in the expiratory passage, which allows for PEEP to be monitored. Expired air also passes through a viral filter and CO2 sensor before being finally exhausted by the ventilator.","All electronic components in this ventilator are connected to an ATMEGA 2560 micro-controller, except for the oxygen generator system, which is connected to an ATMEGA 328P instead. Valves and sensors transmit continuous feedback to the user display, through which the user can adjust settings and input parameters via a control pad and toggle switch. Adjustable parameters include oxygen concentration, mixer tank pressure, humidity, minute volume, breath rate, and I:E ratio. A built-in alarm system engages a buzzer to alert the user of emergencies such as excessive pressure. Other system status alerts are provided through one RGB LED."]
  },
  {
    "title": "Compression-Adjustable Headphones",
    "image": "headphones",
    "blurb": ["These headphones aim to reduce the amount of compression experienced by users prone to headaches and migraines. This is accomplished using a stiff yet bendable horizontal band that contains enough pent-up elastic energy to sufficiently push outwards on both earpieces and reduce compression. The force exerted on each earpiece can be augmented using a knob-cable tension mechanism. Turning the knob clockwise wraps the cables around a spool inside the knob. As the cables are pinned at the other end to metal nodes fixed to the band, clockwise turning will increase cable tension, increasing the band’s “stiffness” and ultimately reducing compression on the user’s ears. Turning the knob counter-clockwise will induce the opposite effect."]
  },  
  {
    "title": "Desktop Speaker",
    "image": "speaker",
    "blurb": ["This computer speaker is composed of a hollow plastic casing, three button knobs and mounts, two 80 mm speaker drivers, one 30 mm speaker driver, and a PCB. The casing is composed of two separate parts: an upper shell and a base platform that also serves as a mounting surface for the PCB. The PCB has three inputs, which provide power, microphone, and auxiliary output capabilities. The button knobs and mounts are located on top of the speaker, and allow the user to adjust output sound’s balance, treble, and bass. The 80 mm speaker drivers rest in large holes cut into the right- and left-hand faces of the casing. By pointing away from each other, the drivers will be able to create a desirable “surround sound” effect for the user. The 30 mm driver was added to the front face to enhance this effect, preventing a “dead-zone” from forming between the two larger drivers. All electrical components can be installed by unscrewing the base platform and separating it from the upper shell.","Composed entirely of ABS plastic, the upper shell and base platform have masses of 290.54 g and 32.84 g, respectively (total mass: 323.38 g). This material was chosen for its relatively high degree of manufacturability, stiffness, and strength. To minimize plastic consumption, the interior was completely hollowed out and other unnecessary walls were reduced or removed (e.g., the rear face of the internal PCB mount)."]
  },
  {
    "title": "P&ID of Large Hospital HVAC System",
    "image": "hvac-system",
    "blurb": ["A large public hospital had an extremely complex HVAC system that had undergone 6 previous partial renovations. As such, no comprehensive up-to-date piping and instrumentation diagram (P&ID) of the entire system existed. I pieced together mechanical drawings from each of these changes and added in up-to-date instrumentation data. I paid meticulous attention to detail, ensuring that the end product was faithful to the source material and contained a maximal density of useful information."]
  }
]
