{"portfolio":[{"name":"Rival Lab","position":"NACA0012 Airfoil","image":"Patrick","blurb":"This NACA0012 airfoil was my first project with the Rival Lab, which focuses on bio-inspired experimental fluid dynamics. It is a complex CAD model containing an embedded network of pressure-measurement channels, taps, and transducer ports that are geometrically optimized to reduce noise and signal error. The model is now being 3D-printed by our partners at EPFL in Switzerland to be used for water-tunnel experiments."},{"name":"Capstone Project","position":"Thermal Management System Optimization","image":"Patrick","blurb":"I am involved in a year-long industry partnership with a manufacturer of heavy-duty electric vehicles. Our team is designing an optimized thermal management system that minimizes redundancy while maintaining the sensitive operating temperatures of Li-ion batteries, motors, and auxiliary components. We validate this design using multi-objective optimization techniques, which are computed using simulations and numerical models that we have developed."},{"name":"QVFT","position":"Aeroponic System Overview","image":"Patrick","blurb":"[p]QVFT employs an aeroponic cultivation method, in which plants grow without soil and are fed by a nutrient-enriched mist. Crops rest in thin, plastic root cups, through which their roots hang into a basin below. Aeroponic vertical farming lends well to automation and can allow for near-complete control over the plant growth environment. The system is broadly divided into five zones: mixing tank, nutrient zone, supply line, growth zone, and return line.[p]The mixing tank is the central hub of the farm. Recycled water from the return line is replenished with nutrients from the nutrient zone before being dispensed to the supply line as needed.[p]"},{"name":"QVFT","position":"Nutrient Zone","image":"Patrick","blurb":"The nutrient zone replenishes macronutrients and micronutrients consumed by the plants during growth and helps to maintain a consistent, weakly acidic pH. Nutrients A and B are kept in separate tanks to prevent their dissolved solutes from reacting with each other while in storage. The pH tank contains a mixture to counterbal-ance the water acidification caused by the reverse-osmosis process performed in the return line."},{"name":"QVFT","position":"Supply Line","image":"Patrick","blurb":"[p]The supply line transports nutrient-enriched fluid from the mixing tank to four sprinkler lines laid across the two levels of the growth zone.[p]The 3-way valve normally permits outflow to the growth zone and prevents outflow to the excess water storage tank. However, its orientation can be reversed by the automation subsystem when the mixing tank contains excessive water or must be drained for maintenance. The valve always permits inflow from the mixing tank.[p]The supply pump works in concert with a pressure switch, accumulator, and pressure regulator to maintain a consistent 60-120 psi pressure at the sprinklers. The sprinklers require this pressure range to produce the microscopic mist droplet size that allows for rapid nutrient absorption by the plant roots.[p]Two solenoid valves control the misting cycles for the two levels of plants in the growth zone. Currently, the cycle is planned to be: 15 seconds ON (valves = open) and 30 seconds OFF (valves = closed). The diaphragm accumulator prevents pressure fluctuations between these two modes by storing excess supply line pressure when the solenoids are closed and passively releasing it when they are opened.[p]A manual pressure release valve is included to allow an operator to depressurize the supply line before performing maintenance tasks. [p]Bernoulli’s equation and conservation laws were used to determine the pump size and pipe dimensions that would provide the required sprinkler pressure of 60-120 psi. A MATLAB script was created to perform these calculations.[p]"},{"name":"QVFT","position":"Growth Zone (Interior)","image":"Patrick","blurb":"The growth zone contains two levels that together hold forty-eight plants. The plants rest in thin, plastic cups which have slots through which their roots can dangle into a plastic growth basin. Mist is emitted from ninety-six sprinkler heads (forty-eight per level), which are oriented at alternating angles to ensure complete mist coverage of the growth basin. After spraying, the mist collects on the sloped floor of the growth basin and passively trickles through the drain and towards the return line. Compared to the inflow from the supply line, the outbound fluid will be slightly nutrient-depleted and will have lost some vol-ume due to evaporation."},{"name":"QVFT","position":"Growth Zone (Exterior)","image":"Patrick","blurb":"The growth zone contains two levels that together hold forty-eight plants. The plants rest in thin, plastic cups which have slots through which their roots can dangle into a plastic growth basin. Mist is emitted from ninety-six sprinkler heads (forty-eight per level), which are oriented at alternating angles to ensure complete mist coverage of the growth basin. After spraying, the mist collects on the sloped floor of the growth basin and passively trickles through the drain and towards the return line. Compared to the inflow from the supply line, the outbound fluid will be slightly nutrient-depleted and will have lost some vol-ume due to evaporation."},{"name":"QVFT","position":"Return Line","image":"Patrick","blurb":"[p]The vast majority of the mist sprayed in the growth zone can be recollected and recycled by the return line. Outflow from the growth zone is first stored in the farm runoff storage tank. From here, it will be pumped through a series of filters in the return line be-fore finally being expelled to the mixing tank for reuse.[p]The 3-way valve normally permits inflow from the farm runoff storage tank and prevents inflow from the freshwater storage. However, its orientation can be reversed by the automation subsystem when extra water is needed in the mixing tank, and there is insufficient fluid available in the farm runoff storage tank. The valve always permits outflow towards the rest of the return line.[p]Two identical filtration branches are arranged in parallel, each of which can be blocked or unblocked with a manual shutoff valve. In practice, only one filtration branch will be active at a time. The inactive branch serves as a bypass for when the filter components on the main branch are being maintained or replaced. In these situations, the main branch’s manual shutoff valve would be closed, and the bypass branch’s valve opened, thereby allowing the farm to continue operating without interference. Check valves are strategically placed on either side of the airlock to prevent flow from the main branch from passing backwards down the bypass branch or vice versa.[p]There is a particle filter, RO filter, and ultraviolet (UV) filter on each filtration branch. The particle filter removes larger sediments from the fluid, while the RO filter eliminates most of the remaining nutrients and the UV filter kills any pathogens.[p]The mixing tank contains an electrical conductivity (EC) meter, which is a useful tool that can detect the total concentration of solids (i.e., nutrients) dissolved in a fluid. However, it is entirely unable to determine the partial concentrations of individual species which comprise that solute. Given this limitation, all remnant nutrients within the recycled fluid will be stripped in the return line via RO (EC reduced to ~0) before being released to the mixing tank. Doing so will allow for an ideal dose to be consistently added to the mixing tank by the nutrient zone.[p]"},{"name":"Code Life Ventilator Challenge","position":"AirMax Dual-Mode COVID-19 Ventilator","image":"Patrick","blurb":"Last spring, I collaborated with a team of professional engineers to develop the “AirMax DMV”, a low-cost, oxygen-generating mechanical ventilator intended to address shortages caused by COVID-19 in developing countries. Our design ranked in the top 65 of 1,029 international submissions at the Code Life Ventilator Challenge in March 2020. One of my contributions involved computational fluid dynamics, where I applied the Brinkman equations for flow through porous media. The goal of this process was to quantify the degree of oxygen generation within zeolite adsorption cylinders."},{"name":"Hospital Heating System","position":"Piping & Instrumentation Diagram","image":"Patrick","blurb":"A large public hospital had an extremely complex HVAC system that had undergone 6 previous partial renovations. As such, no comprehensive up-to-date P&ID of the entire system existed. I pieced together mechanical drawings from each of these changes and added in up-to-date instrumentation data. I paid meticulous attention to detail, ensuring that the end product was faithful to the source material and contained a maximal density of useful information."}]}